Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་གཟུང་དུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nongrasping of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྐད་ཅིག་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is inexhaustible.” “

source: ཆོས་ཐམས་ཅད་བྱང་ཞིང་ཟད་པའི་ཕྱིར་རོ།
en: This is owing to the absolute exhaustion of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྐྱེ་བ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: IV: 2} “Blessed Lord, this perfection of wisdom is the perfection that is nonarising.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཐམས་ཅད་སྐྱེ་བ་དང་འགག་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonarising and nonceasing of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱེད་པ་པོ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without a creator.” “

source: བྱེད་པ་པོ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of [any] creators!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཤེས་པ་པོ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without a knower.” “

source: ཤེས་པ་པོ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the inanimate nature of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འཕོ་བ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that does not transmigrate.” “

source: འཆི་བ་དང་སྐྱེ་བ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of death and rebirth!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འཇིག་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that does not disintegrate.” “

source: ཆོས་ཐམས་ཅད་འཇིག་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nondisintegration of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྨི་ལམ་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection like a dream.” “

source: རྨི་ལམ་མཐོང་བ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the perception of dreams!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྒྲ་བརྙན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection like an echo.” “

source: ཉན་པ་དང་། སྒྲར་བརྗོད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of a listener or a speaker!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མིག་ཡོར་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection like an optical aberration.” “

source: མེ་ལོང་གི་བཞིན་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of mirrors and reflections!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྨིག་རྒྱུའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection like a mirage.” “

source: ཆུ་འབབ་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of flowing water!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྒྱུ་མའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection like a magical display.” “

source: །མཚན་མ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of signs!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྨོངས་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without delusion.” “

source: མ་རིག་པའི་མུན་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the darkness of ignorance!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without afflicted mental states.” “

source: ཀུན་ནས་ཉོན་མོངས་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of all afflicted mental states!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྣམ་པར་བྱང་བ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without purification.” “

source: ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonexistence of afflicted mental states!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དམིགས་སུ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without apprehending.” “

source: གནས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།།
en: This is owing to the nonapprehension of a basis!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྤྲོས་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without conceptual elaboration.” “

source: སྤྲོས་པ་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པའི་ཕྱིར་རོ།
en: This is owing to the eradication of all conceptual elaborations!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རློམ་སེམས་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without conceits.” “

source: རློམ་སེམས་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པའི་ཕྱིར་རོ།
en: This is owing to the eradication of all conceits!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་གཡོ་བའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: IV: 3} “Blessed Lord, this perfection of wisdom is the perfection that is unshakeable.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཀྱི་དབྱིངས་གནས་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: This is owing to the stability of the realm of phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདོད་ཆགས་དང་བྲལ་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection free from desires.” “

source: ཆོས་ཐམས་ཅད་མ་ནོར་བ་ཡང་དག་པ་ཉིད་དུ་མངོན་པར་འཚང་རྒྱ་བར་བྱེད་པའི་ཕྱིར་རོ།
en: This is owing to the incontrovertible, genuinely manifest buddhahood of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཀུན་ནས་ལྡང་བ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without obsession.” “

source: ཆོས་ཐམས་ཅད་རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonconceptuality of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཞི་བའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is at peace.” “

source: ཆོས་ཐམས་ཅད་མཚན་མ་མེད་ཅིང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the signlessness and nonapprehension of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདོད་ཆགས་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without desire.” “

source: འདོད་ཆགས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of desire!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཞེ་སྡང་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without hatred.” “

source: ཞེ་སྡང་ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the absence of hatred!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་གཏི་མུག་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without delusion.” “

source: མི་ཤེས་པའི་མུན་པ་ཐམས་ཅད་སེལ་བའི་ཕྱིར་རོ།
en: This is owing to the dispelling of all the darkness of ignorance!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཉོན་མོངས་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection without afflicted mental states.” “

source: ཡོངས་སུ་རྟོག་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the absence of imaginary thoughts!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སེམས་ཅན་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is not sentient.” “

source: སེམས་ཅན་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the absence of beings!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རབ་ཏུ་སྤངས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is forsaken.” “

source: ཆོས་ཐམས་ཅད་ཀུན་ནས་ལྡང་བ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonarising of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཐའ་གཉིས་སུ་མི་འགྱུར་བའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that does not resort to the two extremes.” “

source: མཐའ་རྣམ་པར་སྤོང་བའི་ཕྱིར་རོ།
en: This is owing to the abandonment of extremes!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཐ་མི་དད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is undifferentiated.” “

source: ཆོས་ཐམས་ཅད་འདྲེས་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonassociation of all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཉམས་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is unblemished.” “

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་འདའ་བར་བྱེད་པའི་ཕྱིར་རོ།
en: This is owing to the transcendence of the śrāvaka and pratyekabuddha levels!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྣམ་པར་རྟོག་པ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: IV: 4} “Blessed Lord, this perfection of wisdom is the perfection that is nonconceptual.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of all concepts!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མིང་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is nameless.” “

source: ཆོས་ཐམས་ཅད་ཀྱི་ཚད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the dimensions of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ནམ་མཁའི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Blessed Lord, this perfection of wisdom is the perfection that is [unattached] like space.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the absence of attachment with regard to all phenomena!” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་རྟག་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is impermanent.” “

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྡུག་བསྔལ་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is imbued with suffering.” “

source: ཆོས་ཐམས་ཅད་ཚོལ་བར་སྦྱོར་བ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the absence of preoccupation with all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བདག་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is not a self.” “

source: ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཆགས་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to nonfixation upon all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is emptiness.” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཚན་ཉིད་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is without defining characteristics.” “

source: ཆོས་ཐམས་ཅད་མངོན་པར་གྲུབ་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonestablishment of all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of internal phenomena.” “

source: ནང་གི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of internal phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཕྱི་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of external phenomena.” “

source: ཕྱིའི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of external phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of external and internal phenomena.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཕྱི་ནང་གི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of external and internal phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of emptiness.” “

source: སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the emptiness of emptiness!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆེན་པོ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of great extent.” “

source: ཆེན་པོ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the emptiness of great extent!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་དམ་པ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: IV: 5} “Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of ultimate reality.” “

source: དོན་དམ་པ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the emptiness of ultimate reality!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདུས་བྱས་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of conditioned phenomena.” “

source: འདུས་བྱས་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the emptiness of conditioned phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདུས་མ་བྱས་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of unconditioned phenomena.” “

source: འདུས་མ་བྱས་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the emptiness of unconditioned phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of the unlimited.” “

source: མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the emptiness of the unlimited!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of that which has neither beginning nor end.” “

source: ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the emptiness of that which has neither beginning nor end!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of nonexclusion.” “

source: དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the emptiness of nonexclusion!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of inherent existence.” “

source: འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of conditioned and unconditioned phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of all phenomena.” “

source: ཕྱི་ནང་གི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of internal and external phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of intrinsic defining characteristics.” “

source: རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དབེན་པའི་ཕྱིར་རོ།
en: This is owing to the voidness of the emptiness of intrinsic defining characteristics!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་དམིགས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of nonapprehensibility.” “

source: མི་དམིགས་པ་སྟོང་པ་ཉིད་དབེན་པའི་ཕྱིར་རོ།
en: This is owing to the voidness of the emptiness of nonapprehensibility!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of nonentities.” “

source: དངོས་པོ་མེད་པའི་ཆོས་ཉིད་ཀྱི་ཕྱིར་རོ།
en: This is owing to reality, which is nonentity!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of the essential nature.” “

source: ཆོས་རྣམས་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པའི་ཕྱིར་རོ།
en: This is owing to the voidness of essential nature with respect to all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the emptiness of the essential nature of nonentities.” {

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: Ki.IV: 6} “This is owing to the nonapprehension of the emptiness of the essential nature of nonentities!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དྲན་པ་ཉེ་བར་གཞག་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the applications of mindfulness.” “

source: ལུས་དང་ཚོར་བ་དང་སེམས་དང་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the body, feelings, mind, and phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཡང་དག་པར་སྤོང་བའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the correct exertions.” “

source: དགེ་བ་དང་། མི་དགེ་བའི་ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of virtuous and nonvirtuous attributes!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the supports for miraculous ability.” “

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the four supports for miraculous ability!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དབང་པོའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the faculties.” “

source: དབང་པོ་ལྔ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the five faculties!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྟོབས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the powers.” “

source: སྟོབས་ལྔ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the five powers!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the branches of enlightenment.” “

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the seven branches of enlightenment!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ལམ་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the path.” “

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the noble eightfold path!”

source: སྟོང་པ་ཉིད་ཀྱི་རྣམ་པ་དང་། རྣམ་པར་དབེན་པའི་རྣམ་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the aspects of emptiness and the aspect of voidness!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཚན་མ་མ་མཆིས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes signlessness.” “

source: ཞི་བའི་རྣམ་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: This is owing to the nonapprehension of the aspects of peace!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི། སྨོན་པ་མེད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes wishlessness.” “

source: སྨོན་པ་མེད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of aspirations!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རྣམ་པར་ཐར་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the aspects of liberation.” “

source: རྣམ་པར་ཐར་པ་བརྒྱད་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the eight aspects of liberation!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the serial steps of meditative absorption.” “

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of the nine serial steps of meditative absorption!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྦྱིན་པ་དང་།
en: IV: 7} “Blessed Lord, this perfection of wisdom is the perfection of generosity.” “

source: སེར་སྣ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of miserliness!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚུལ་ཁྲིམས་དང་།
en: Blessed Lord, this perfection of wisdom is the perfection of ethical discipline.” “

source: ཚུལ་ཁྲིམས་ངན་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of degenerate morality!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection of tolerance.” “
